---
title: 深入浅出Joern（二）CPG与图数据库
url: https://govuln.com/news/url/akpg
source: Sec-News 安全文摘
date: 2023-08-24
fetch_date: 2025-10-04T11:58:44.255919
---

# 深入浅出Joern（二）CPG与图数据库



[LoRexxar's Blog | 盲驴隆忙聛炉忙聤聙忙聹炉氓聢聠盲潞芦](/)

[LoRexxar's Blog | 盲驴隆忙聛炉忙聤聙忙聹炉氓聢聠盲潞芦](/)

忙路卤氓聟楼忙碌聟氓聡潞Joern茂录聢盲潞聦茂录聣CPG盲赂聨氓聸戮忙聲掳忙聧庐氓潞聯



# 忙路卤氓聟楼忙碌聟氓聡潞Joern茂录聢盲潞聦茂录聣CPG盲赂聨氓聸戮忙聲掳忙聧庐氓潞聯

sast
joern
cpg


2023/08/22




Share

* 
* 
* 
* 
* 

![](/assets/loading.svg)

氓聹篓盲赂聤莽炉聡忙聳聡莽芦聽茅聡聦茂录聦忙聢聭盲禄卢盲禄聨Joern氓聟楼忙聣聥氓陇搂猫聡麓盲禄聥莽禄聧盲潞聠**CPG(Code Property Graph)**莽職聞猫庐戮猫庐隆莽聬聠氓驴碌氓聮聦莽庐聙氓聧聲茅聙禄猫戮聭

* <https://lorexxar.cn/2023/08/21/joern-and-cpg/>

盲陆聠氓庐聻茅聶聟盲赂聤忙聺楼猫炉麓茂录聦氓娄聜忙聻聹忙聝鲁猫娄聛忙聸麓忙路卤氓聟楼莽職聞盲潞聠猫搂拢Joern茂录聦**CPG氓聮聦氓聸戮忙聲掳忙聧庐氓潞聯**忙聵炉莽禄聲盲赂聧氓录聙莽職聞盲赂聙盲赂陋猫炉聺茅垄聵茫聙聜CPG盲陆聹盲赂潞盲赂聙莽搂聧**盲禄拢莽聽聛氓卤聻忙聙搂氓聸戮**茂录聦氓掳卤氓驴聟茅隆禄氓炉禄忙聣戮盲赂聙莽搂聧氓聸戮忙聲掳忙聧庐氓潞聯盲陆聹盲赂潞猫陆陆盲陆聯茂录聦氓掳卤氓聝聫忙聢聭盲禄卢氓赂赂莽聰篓莽職聞忙聲掳忙聧庐氓聮聦SQL忙聲掳忙聧庐氓潞聯莽職聞氓聟鲁莽鲁禄盲赂聙忙聽路茫聙聜

忙聴搂莽聣聢忙聹卢莽職聞Joern盲陆驴莽聰篓莽職聞**Gremlin**茂录聦盲陆聠氓聬聨忙聺楼莽職聞氓录聙氓聫聭盲赂颅忙聧垄忙聢聬盲潞聠**OverflowDB**茂录聦氓聹篓joern盲赂颅盲鹿聼氓庐聦氓聟篓忙聰炉忙聦聛盲陆驴莽聰篓**OverflowDB莽職聞忙聼楼猫炉垄猫炉颅忙鲁聲**茫聙聜

* <https://github.com/ShiftLeftSecurity/overflowdb>

盲陆聠氓卤聻忙聙搂氓聸戮忙聹卢猫潞芦忙虏隆忙聹聣盲禄聙盲鹿聢莽聣鹿氓录聜忙聙搂茂录聦忙炉聰猫戮聝氓赂赂猫搂聛莽職聞忙炉聰氓娄聜**Neo4J茂录聦OrientDB**忙聢聳猫聙聟**JanesGraph**茅聝陆忙聰炉忙聦聛CPG莽職聞猫隆篓莽聨掳氓陆垄氓录聫茫聙聜

盲陆聠茂录聦氓聹篓猫驴聶盲鹿聥氓聣聧茂录聦忙聢聭盲禄卢茅娄聳氓聟聢茅聹聙猫娄聛莽聼楼茅聛聯茂录聦**盲赂潞盲禄聙盲鹿聢忙聵炉氓聸戮茂录聼**

# 盲赂潞盲禄聙盲鹿聢忙聵炉氓聸戮茂录聼

氓聹篓盲赂聤莽炉聡忙聳聡莽芦聽盲赂颅茂录聦忙聢聭氓聹篓猫庐虏盲潞聠CPG莽職聞猫庐戮猫庐隆忙聙聺猫路炉忙聴露忙聸戮莽禄聫忙聫聬氓聢掳猫驴聡盲赂聙盲潞聸莽聸赂氓聟鲁莽職聞氓聠聟氓庐鹿茫聙聜

氓娄聜忙聻聹猫炉麓CFG(**control flow graphs**)莽聸赂忙炉聰AST忙聺楼猫炉麓忙聹聙氓陇搂莽職聞莽聣鹿莽聜鹿忙聵炉**氓赂娄忙聹聣忙聵聨莽隆庐忙聲掳忙聧庐忙碌聛氓聬聭莽職聞忙碌聛氓聬聭**茂录聦氓聹篓忙聲掳忙聧庐忙碌聛氓聢聠忙聻聬**氓聫炉猫聝陆**忙聸麓忙聹聣盲录聵氓聤驴茫聙聜

茅聜拢盲鹿聢CPG莽聸赂忙炉聰CFG忙聺楼猫炉麓忙聹聣盲赂聙盲赂陋氓戮聢氓陇搂莽職聞莽聣鹿莽聜鹿氓掳卤忙聵炉**盲驴隆忙聛炉茅聡聫氓陇搂**茂录聦猫聙聦氓聸戮忙聹聙氓陇搂莽職聞莽聣鹿莽聜鹿盲鹿聼氓聹篓盲潞聨茂录聦氓掳卤忙聵炉**氓聫炉盲禄楼氓庐鹿莽潞鲁盲驴隆忙聛炉茅聡聫氓路篓氓陇搂莽職聞氓聠聟氓庐鹿**茫聙聜

氓聛聡猫庐戮忙聢聭盲禄卢忙聹聣猫驴聶忙聽路盲赂聙忙庐碌盲禄拢莽聽聛

|  |  |
| --- | --- |
| ``` 1 2 3 4 5 ``` | ``` a = new A() b = a.b c.a = b.a d.a = c c.b = d.c ``` |

猫驴聶茅聡聦莽庐聙氓聧聲莽職聞氓聡聽猫隆聦盲禄拢莽聽聛茂录聦氓聟露氓庐聻氓卤聲莽陇潞盲潞聠莽聸赂氓陆聯氓陇聧忙聺聜莽職聞盲戮聺猫碌聳茅聯戮茂录聦abcd氓聡聽盲赂陋氓聫聵茅聡聫盲赂颅忙聹聣莽聺聙氓陇聧忙聺聜莽職聞盲潞聮莽聸赂忙聦聡氓聬聭氓聟鲁莽鲁禄茂录聦氓娄聜忙聻聹**莽聰篓忙聳聡氓颅聴忙聺楼猫隆篓莽陇潞abcd盲鹿聥茅聴麓莽職聞氓聟鲁莽鲁禄忙聢聭盲禄卢氓聫炉猫聝陆茅聹聙猫娄聛忙聥聠氓聢聠氓戮聢氓陇職茅聝篓氓聢聠茫聙聜**

|  |  |
| --- | --- |
| ``` 1 2 3 4 ``` | ``` a -> A() b -> A().b c.a -> A().b.a c.b -> .... ``` |

忙聢聭莽聰職猫聡鲁氓戮聢茅職戮莽聰篓忙聳聡氓颅聴莽職聞忙聳鹿氓录聫猫隆篓猫戮戮氓聡潞盲禄聳盲禄卢盲鹿聥茅聴麓莽職聞氓聟鲁莽鲁禄茂录聦猫聙聦**氓聸戮氓聹篓猫驴聶忙聽路莽職聞氓聹潞忙聶炉盲赂聥氓掳卤氓聫聵氓戮聴氓戮聢忙聹聣盲录聵氓聤驴茫聙聜**

![img](https://lorexxar-blog.oss-cn-shanghai.aliyuncs.com/blog/202308221725366.png)

氓陆聯莽聞露猫驴聶氓聫陋忙聵炉盲赂聙盲赂陋莽虏聴忙碌聟莽職聞盲戮聥氓颅聬茂录聦盲陆聠氓路虏莽禄聫氓戮聢忙聵聨忙聵戮莽職聞猫聝陆忙聞聼猫搂聣氓聡潞忙聺楼氓聸戮氓聮聦忙聳聡氓颅聴盲鹿聥茅聴麓莽職聞氓路庐猫路聺盲潞聠茂录聦**氓聸戮氓聟鲁莽鲁禄氓聫炉盲禄楼氓戮聢猫陆禄忙聺戮莽職聞猫隆篓猫戮戮氓聡潞忙聳聡氓颅聴氓戮聢茅職戮猫隆篓猫戮戮氓聡潞忙聺楼莽職聞盲驴隆忙聛炉茅聡聫茫聙聜**

# Joern盲赂聨氓聸戮

Joern莽聰篓盲潞聠CPG忙聺楼**氓聜篓氓颅聵盲禄拢莽聽聛莽職聞忙聣聙忙聹聣猫聤聜莽聜鹿氓聟鲁莽鲁禄氓聮聦氓卤聻忙聙搂忙聲掳忙聧庐**茂录聦莽聰卤盲潞聨CPG莽職聞盲驴隆忙聛炉茅聡聫氓陇搂茂录聦忙聣聙盲禄楼Joern莽聰職猫聡鲁**忙聫聬盲戮聸盲潞聠氓庐聵忙聳鹿莽職聞莽聰聼忙聢聬AST茫聙聛CFG莽颅聣氓聟露盲禄聳莽禄聯忙聻聞莽職聞忙聨楼氓聫拢**茂录聦氓炉鹿盲潞聨C/C++莽聰職猫聡鲁忙聰炉忙聦聛氓陇職莽搂聧猫聡陋氓庐職盲鹿聣莽職聞莽禄聯忙聻聞茫聙聜

* Abstract Syntax Trees (AST)
* Control Flow Graphs (CFG)
* Control Dependence Graphs (CDG)
* Data Dependence Graphs (DDG)
* Program Dependence graphs (PDG)
* Code Property Graphs ([CPG14](https://www.sec.cs.tu-bs.de/pubs/2014-ieeesp.pdf))
* Entire graph, i.e. convert to a different graph format (ALL)

氓聹篓Joern莽職聞氓聭陆盲禄陇猫隆聦盲陆聽氓聫炉盲禄楼莽聸麓忙聨楼**盲陆驴莽聰篓莽聸赂氓潞聰莽職聞氓聭陆盲禄陇莽聰聼忙聢聬氓炉鹿氓潞聰莽職聞忙聽录氓录聫**

|  |  |
| --- | --- |
| ``` 1 2 3 4 ``` | ``` cpg.method($name).dotAst.l // output AST in dot format cpg.method($name).dotCfg.l // output CFG in dot format ... cpg.method($name).dotCpg14.l // output CPG'14 in dot format ``` |

![img](https://lorexxar-blog.oss-cn-shanghai.aliyuncs.com/blog/202308221725427.png)

忙聹聣盲赂陋氓戮聢忙聹聣忙聞聫忙聙聺莽職聞忙聵炉茂录聦氓娄聜忙聻聹盲陆聽莽職聞莽聰碌猫聞聭猫拢聟盲潞聠**Graphviz**茂录聦Joern猫驴聵氓聫炉盲禄楼猫掳聝莽聰篓Graphviz忙聺楼莽禄聵氓聸戮茂录聦猫聶陆莽聞露莽聰聼忙聢聬莽職聞氓聸戮氓戮聢茅職戮莽聹聥茫聙聜

* <https://graphviz.org/download/>

氓庐聣猫拢聟Graphviz盲鹿聥氓聬聨忙聢聭盲禄卢氓聫炉盲禄楼茅聙職猫驴聡氓聭陆盲禄陇忙聺楼莽禄聵氓聸戮

|  |  |
| --- | --- |
| ``` 1 2 3 4 ``` | ``` cpg.method($name).plotDotAst // plot AST cpg.method($name).plotDotCfg // plot CFG ... cpg.method($name).plotDotCpg14 // plot CPG'14 ``` |

![img](https://lorexxar-blog.oss-cn-shanghai.aliyuncs.com/blog/202308221725174.png)

猫炉麓氓庐聻猫炉聺茂录聦盲赂聧氓陇陋氓庐聻莽聰篓茂录聦盲陆聠忙聵炉氓戮聢忙聳鹿盲戮驴

# Neo4J

莽聸赂忙炉聰Graphviz猫驴聶莽搂聧盲禄聟盲禄聟莽聰篓忙聺楼盲赂麓忙聴露氓卤聲莽陇潞氓聸戮莽職聞氓潞聰莽聰篓忙聺楼猫炉麓茂录聦**Neo4J氓聢聶忙聵炉忙聽聡氓聡聠猫聙聦盲赂聰茅聺聻氓赂赂忙聢聬莽聠聼莽職聞氓聸戮忙聲掳忙聧庐氓潞聯**茂录聦盲赂聧盲陆聠忙聙搂猫聝陆氓录潞茂录聦猫聙聦盲赂聰猫驴聵氓庐聻莽聰篓茫聙聜

* <https://github.com/neo4j/neo4j>
* <https://neo4j.com/>

盲陆聽氓聫炉盲禄楼氓聹篓氓庐聵莽陆聭盲赂聥猫陆陆氓聟聧猫麓鹿莽職聞neo4j茂录聦氓聟露盲赂颅氓聦聟忙聥卢忙聹聧氓聤隆莽芦炉氓聮聦氓庐垄忙聢路莽芦炉莽聣聢忙聹卢茂录聦忙聹聧氓聤隆莽芦炉莽聣聢忙聹卢氓聬炉氓聤篓氓聬聨盲录職茅禄聵猫庐陇猫路聭氓聢掳7474莽芦炉氓聫拢盲赂聤茫聙聜

**Neo4j盲陆驴莽聰篓莽職聞忙聼楼猫炉垄猫炉颅猫篓聙氓聫芦氓聛職Cypher茂录聦猫驴聶忙聵炉盲赂聙莽搂聧氓拢掳忙聵聨氓录聫莽職聞氓聸戮忙聼楼猫炉垄猫炉颅猫篓聙**茂录聦忙聢聭盲赂陋盲潞潞猫搂聣氓戮聴Cypher氓聟露氓庐聻莽庐聴忙聵炉忙炉聰猫戮聝氓聫聧盲潞潞莽卤禄莽職聞盲赂聙莽搂聧猫炉颅猫篓聙茂录聦氓聟路盲陆聯莽職聞猫炉颅忙鲁聲氓聫炉盲禄楼莽聹聥氓炉鹿氓潞聰莽職聞忙聳聡忙隆拢茫聙聜

* <https://neo4j.com/docs/cypher-manual/current/clauses/>

莽庐聙氓聧聲忙聺楼猫庐虏**Cypher盲赂颅氓炉鹿氓潞聰SQL莽職聞猫炉颅氓聫楼氓聟鲁莽鲁禄忙聹聣氓聡聽盲赂陋忙炉聰猫戮聝莽聣鹿氓聢芦莽職聞**茂录聦茅娄聳氓聟聢氓掳卤忙聵炉MATCH氓聮聦where茫聙聜

|  |  |
| --- | --- |
| ``` 1 2 3 4 ``` | ``` # SQL select Person from user where born = 'beijing' # Cypher MATCH (a:Person)-[:BORN]->(b:Location {city:'beijing'}) RETURN a,b ``` |

MATCH氓聮聦where氓聹篓盲赂陇莽搂聧忙聼楼猫炉垄猫炉颅氓聫楼盲赂颅忙聵炉莽卤禄盲录录莽職聞氓聤聼猫聝陆茂录聦氓聟露盲赂颅莽職聞氓聦潞氓聢芦氓掳卤忙聵炉**MATCH氓聦鹿茅聟聧莽職聞忙聵炉氓聸戮盲赂颅猫聤聜莽聜鹿盲鹿聥茅聴麓莽職聞氓聟鲁莽鲁禄茫聙聜Cypher猫炉颅忙鲁聲忙炉聰猫戮聝氓录潞猫掳聝猫聤聜莽聜鹿盲鹿聥茅聴麓莽職聞氓聟鲁莽鲁禄**茂录聦忙炉聰氓娄聜-氓掳卤忙聵炉忙聴聽忙聳鹿氓聬聭氓聟鲁莽鲁禄茂录聦->氓掳卤忙聵炉忙聹聣忙聳鹿氓聬聭氓聟鲁莽鲁禄茫聙聜

|  |  |
| --- | --- |
| ``` 1 2 3 4 5 6 ``` | ``` match    (node)-[relationship]->(node) where   茂录聢node  |  relationship) return      (node | relationship) ``` |

氓聟露盲禄聳莽職聞忙炉聰氓娄聜氓聢聸氓禄潞猫聤聜莽聜鹿茫聙聛氓聢聽茅聶陇猫聤聜莽聜鹿茫聙聛氓聢聸氓禄潞氓聟鲁莽鲁禄茫聙聛忙聬聹莽麓垄氓聦鹿茅聟聧莽職聞猫聤聜莽聜鹿盲禄楼氓聫聤氓聟鲁莽鲁禄莽颅聣莽颅聣氓掳卤盲赂聧猫碌聵猫驴掳盲潞聠茂录聦莽庐聴忙聵炉忙炉聰猫戮聝莽卢娄氓聬聢莽聬聠猫搂拢莽職聞猫炉颅猫篓聙茅聙禄猫戮聭茫聙聜

猫聙聦莽聸赂氓炉鹿盲潞聨忙聶庐茅聙職莽職聞忙聲掳忙聧庐氓潞聯忙聺楼猫炉麓茂录聦**氓聸戮忙聲掳忙聧庐氓潞聯忙聹聣莽聺聙氓聫炉猫聝陆忙聵炉盲赂聙莽搂聧盲录聵氓聤驴莽職聞莽聣鹿忙聙搂茂录聦氓掳卤忙聵炉氓聫炉盲禄楼莽聸麓忙聨楼茅聙職猫驴聡Neo4j莽職聞忙碌聫猫搂聢氓聶篓莽聸麓忙聨楼忙聯聧盲陆聹氓聸戮氓聠聟氓庐鹿盲禄楼氓聫聤莽禄聯忙聻聞茫聙聜**

![img](https://lorexxar-blog.oss-cn-shanghai.aliyuncs.com/blog/202308221725125.png)

莽聸麓忙聨楼**莽聰篓茅录聽忙聽聡莽聜鹿氓聡禄氓聬聞盲赂陋猫聤聜莽聜鹿忙聼楼莽聹聥氓炉鹿氓潞聰莽職聞氓卤聻忙聙搂盲禄楼氓聫聤氓庐聝盲禄卢盲鹿聥茅聴麓莽職聞氓聟鲁莽鲁禄**茂录聦氓鹿露盲赂聰氓聫炉盲禄楼莽聸麓忙聨楼忙聥聳氓聤篓盲禄聳盲禄卢茫聙聜

![img](https://lorexxar-blog.oss-cn-shanghai.aliyuncs.com/blog/202308221725248.png)

莽聜鹿氓聡禄猫聤聜莽聜鹿盲赂聥茅聺垄莽職聞忙聦聣茅聮庐茂录聦氓聫炉盲禄楼莽聸麓忙聨楼**忙聼楼莽聹聥氓聢掳猫聤聜莽聜鹿猫驴聻忙聨楼氓聢掳莽職聞氓聟露盲禄聳猫聤聜莽聜鹿**茂录聦氓戮聢忙聳鹿盲戮驴盲鹿聼氓戮聢莽聸麓猫搂聜茫聙聜

# Joern盲赂聨Neo4J

氓聣聧茅聺垄猫炉麓盲潞聠茂录聦**Joern盲陆驴莽聰篓盲潞聠猫聡陋氓路卤氓聛職莽職聞OverflowDBl忙聺楼盲陆聹盲赂潞氓聸戮忙聲掳忙聧庐氓潞聯氓颅聵氓聜篓CPG**茂录聦盲陆聠CPG忙聹卢猫潞芦忙虏隆忙聹聣盲禄聙盲鹿聢莽聣鹿氓录聜忙聙搂茂录聦盲鹿聼氓掳卤忙聞聫氓聭鲁莽聺聙盲禄聳氓聫炉盲禄楼氓聹篓盲禄禄忙聞聫盲赂聙莽搂聧氓聸戮忙聲掳忙聧庐氓潞聯盲赂聤氓炉录氓聟楼茫聙聜

猫聙聦Joern忙聹卢猫潞芦忙聵炉猫聡陋氓赂娄盲潞聠猫驴聶盲赂陋氓聤聼猫聝陆莽職聞茂录聦氓掳卤忙聵炉joern-export茫聙聜**氓庐聝忙聰炉忙聦聛盲陆聽氓炉录氓聡潞Joern莽職聞CPG氓聢掳neo4j , graphml, graphson 氓聮聦 graphviz dot茫聙聜**

|  |  |
| --- | --- |
| ``` 1 2 3 4 ``` | ``` ./joern-export --repr=all --format=neo4jcsv ./joern-export --repr=all --format=graphml ./joern-export --repr=all --format=graphson ./joern-export --repr=all --format=dot ``` |

猫娄聛盲陆驴莽聰篓joern-export氓炉录氓聡潞忙聲掳忙聧庐莽職聞猫炉聺茂录聦**茅聹聙猫娄聛忙聦聡氓庐職CPG莽職聞盲陆聧莽陆庐**茂录聦猫驴聶盲赂陋盲赂聹猫楼驴盲录職氓颅聵氓聹篓**Joern莽聸庐氓陆聲盲赂聥莽職聞workspace**氓陆聯盲赂颅茂录聦氓鹿露盲赂聰茅聹聙猫娄聛忙聦聡氓庐職output茂录聦茅禄聵猫庐陇忙聵炉./out茫聙聜

![img](https://lorexxar-blog.oss-cn-shanghai.aliyuncs.com/blog/202308221725713.png)

![img](https://lorexxar-blog.oss-cn-shanghai.aliyuncs.com/blog/202308221726073.png)

![img](https://lorexxar-blog.oss-cn-shanghai.aliyuncs.com/blog/202308221725960.png)

莽聞露氓聬聨忙聢聭盲禄卢氓聫炉盲禄楼忙聝鲁氓聤聻忙鲁聲**忙聤聤猫驴聶盲潞聸csv忙聳聡盲禄露氓炉录氓聟楼氓聢掳Neo4j氓陆聯盲赂颅**茫聙聜氓陆聯莽聞露盲陆聽氓聫炉盲禄楼莽聰篓盲赂聙盲潞聸猫聡陋氓路卤莽職聞忙聳鹿氓录聫氓炉录氓聟楼茂录聦盲陆聠joern莽職聞猫驴聶盲赂陋氓聸戮猫驴聵忙聦潞茅潞禄莽聝娄莽職聞茂录聦盲赂禄猫娄聛忙聵炉**neo4j氓炉录氓聟楼氓陇聧忙聺聜莽禄聯忙聻聞忙聲掳忙聧庐茅聹聙猫娄聛忙聦聡氓庐職氓楼陆氓聬聞莽搂聧csv忙聳聡盲禄露莽職聞氓聟鲁猫聛聰茫聙聜**

盲陆聠joern氓陆聯莽聞露盲鹿聼莽禄聶氓聡潞盲潞聠氓炉录氓聟楼莽職聞氓聤聻忙鲁聲茂录聦氓聹篓莽聰聼忙聢聬忙聳聡盲禄露莽職聞忙聴露氓聙聶盲录職**莽禄聶氓聡潞盲赂聙盲赂陋氓炉录氓聟楼氓聭陆盲禄陇莽職聞猫聦聝盲戮聥**茂录聦莽聟搂莽聺聙猫聦聝盲戮聥氓掳卤氓聫炉盲禄楼忙聬聻氓庐職盲潞聠茫聙聜

![img](https://lorexxar-blog.oss-cn-shanghai.aliyuncs.com/blog/202308221725691.png)

茅娄聳氓聟聢joern氓炉录氓聟楼忙聲掳忙聧庐忙聵炉忙聹聣茅聶聬氓聢露莽職聞茂录聦**氓聫陋猫聝陆氓炉录氓聟楼import莽聸庐氓陆聲盲赂聥莽職聞忙聳聡盲禄露**茂录聦猫驴聶盲赂陋import忙聳聡盲禄露盲赂聙猫聢卢盲录職氓聹篓氓炉鹿氓潞聰茅聯戮忙聨楼莽職聞server莽聸庐氓陆聲盲赂聥茅聺垄茂录聦氓娄聜忙聻聹盲陆聽盲陆驴莽聰篓莽職聞忙聵炉neo4j莽職聞desltop忙碌聫猫搂聢氓聶篓茂录聦茅聜拢盲鹿聢盲陆聽氓聫炉盲禄楼莽聸麓忙聨楼忙聣聯氓录聙氓炉鹿氓潞聰莽職聞import莽聸庐氓陆聲茂录聦氓鹿露忙聤聤忙聳聡盲禄露氓陇聧氓聢露猫驴聡氓聨禄茫聙聜

![img](https://lorexxar-blog.oss-cn-shanghai.aliyuncs.com/blog/202308221725662.png)

![img](https://lorexxar-blog.oss-cn-shanghai.aliyuncs.com/blog/202308221725283.png)

茅聶陇盲潞聠忙聳聡盲禄露盲禄楼氓陇聳茂录聦猫驴聵忙聹聣氓掳卤忙聵炉猫驴聶盲赂陋/bin/cypher-shell莽職聞盲陆聧莽陆庐茂录聦**猫驴聶盲赂陋猫聞職忙聹卢氓掳卤氓聹篓氓炉鹿氓潞聰茅聯戮忙聨楼莽聸庐氓陆聲莽職聞bin盲赂聥**

![img](http...